tap "homebrew/bundle"
tap "homebrew/cask-versions"
tap "mongodb/brew"
tap "orangekame3/tap"
# TIFF library and utilities
brew "libtiff"
# Color management engine supporting ICC profiles
brew "little-cms2"
# Image format providing lossless and lossy compression for web images
brew "webp"
# New file format for still image compression
brew "jpeg-xl"
# Codec library for encoding and decoding AV1 video streams
brew "aom"
# Load/unload environment variables based on $PWD
brew "direnv"
# GNU compiler collection
brew "gcc"
# Cryptography and SSL/TLS Toolkit
brew "openssl@1.1"
# Toolkit for image loading and pixel buffer manipulation
brew "gdk-pixbuf"
# Library for JPEG-2000 image manipulation
brew "openjpeg"
# Interpreter for PostScript and PDF
brew "ghostscript"
# Image processing tools collection
brew "graphicsmagick"
# OpenType text shaping engine
brew "harfbuzz"
# File format designed to store large amounts of data
brew "hdf5"
# ISO/IEC 23008-12:2017 HEIF file format decoder and encoder
brew "libheif"
# Tools and libraries to manipulate images in many formats
brew "imagemagick"
# Network authentication protocol
brew "krb5"
# C library for reading and writing MATLAB MAT files
brew "libmatio"
# Framework for layout and rendering of i18n text
brew "pango"
# Library to render SVG files using Cairo
brew "librsvg"
# Java-based project management
brew "maven"
# Open source relational database management system
brew "mysql"
# Development kit for the Java programming language
brew "openjdk@11"
# C library to read whole-slide images (a.k.a. virtual slides)
brew "openslide"
# PDF rendering library (based on the xpdf-3.0 code base)
brew "poppler"
# Object-relational database system
brew "postgresql@14"
# Launcher to analyze a project with SonarQube
brew "sonar-scanner"
# Image processing library
brew "vips"
# This package contains standard utilities for interacting with MongoDB.
brew "mongodb/brew/mongodb-database-tools"
brew "orangekame3/tap/paclear"

cask "visual-studio-code"